// var fs = require("fs");

// const {VK} = require('vk-io');


//http://test-site1022.oml.ru/#access_token=9f930072c89dedc30ecc756615f6d9c4864a8a66660cc08b9cfe7b9d3e6111b8b4e7c56deed5bd983c90e&expires_in=86400&user_id=503131193&state=123456
/*const vk = new VK({
    token: "9f930072c89dedc30ecc756615f6d9c4864a8a66660cc08b9cfe7b9d3e6111b8b4e7c56deed5bd983c90e",
    appId: "7120878"
});
const { api } = vk;
*/
// const sqlite3 = require('sqlite3').verbose();
// var db = new sqlite3.Database('schedule.db');

/*db.run('CREATE TABLE LESSONS(date,week,l1,l2,l3,l4,l5,l6)',(e)=>{
    console.log(e)
});*/


// 


var a = [];
a[1] = {
    "1": "Null",
    "2": "ОМТ",
    "3": "Мат.Стат",
    "4": "Чис.Мет",
    "5": "Null",
    "6": "Null"
}
a[2] = {
    "1": "Null",
    "2": "Инж.Графика",
    "3": "Политология",
    "4": "ОМТ",
    "5": "Чис.Мет",
    "6": "Null"
}
a[3] = {
    "1": "Null",
    "2": "Политология",
    "3": "Физ-ра",
    "4": "ОМТ/Мат.Стат",
    "5": "Null",
    "6": "Null"
}
a[4] = {
    "1": "Сети",
    "2": "Мат.Стат",
    "3": "ОС",
    "4": "Null",
    "5": "Null",
    "6": "Null"
}
a[5] = {
    "1": "Чис.Мет",
    "2": "Сети",
    "3": "ОМТ",
    "4": "Мат.Стат",
    "5": "Null",
    "6": "Null"
}
a[6] = {
    "1": "Null",
    "2": "Null",
    "3": "Инж.Графика",
    "4": "ОС/Сети",
    "5": "Физ-ра",
    "6": "Null"
}
a[0] = {
    "1": "Null",
    "2": "Null",
    "3": "Null",
    "4": "Null",
    "5": "Null",
    "6": "Null"
};

/*db.run('DELETE FROM Lessons', [], (err, rows) => {
    if (err) {
       console.log(err.message);
    }
})*/
/*db.run('DROP TABLE LESSONS', [], (err, rows) => {
        if (err) {
            throw err;
        }
        console.log(err, rows)
    });*/

// let b = [{"day":"","date":"26.01.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"27.01.2020","1":"17вт1 сети","11":"","2":"ООП","22":"","3":"Комп графика","4":"","5":null,"6":null},
//     {"day":"вторник","date":"28.01.2020","1":"ООП","11":"17вт1 бд 2пдгр","2":"17вт1 бд","22":"","3":"17вт1 сети","4":"","5":null,"6":null},
//     {"day":"среда","date":"29.01.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"30.01.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"31.01.2020","1":"физ-ра","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"01.02.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 бд","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"","date":"02.02.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"03.02.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"вторник","date":"04.02.2020","1":"ООП","11":"КГ ","2":"17вт1 бд 1пдгр","22":"КГ ","3":"17вт1 сети","4":"","5":null,"6":null},
//     {"day":"среда","date":"05.02.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"06.02.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"07.02.2020","1":"основы права","11":"","2":"основы права","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"08.02.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети 2пдгр","4":"17вт1 бд 2пдгр","5":null,"6":null},
//     {"day":"","date":"09.02.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"10.02.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"17вт1 сети 2пдгр","5":null,"6":null},
//     {"day":"вторник","date":"11.02.2020","1":"ООП","11":"17вт1 бд 2пдгр","2":"17вт1 бд","22":"","3":"17вт1 сети","4":"","5":null,"6":null},
//     {"day":"среда","date":"12.02.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"13.02.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"14.02.2020","1":"физ-ра","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"15.02.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети 1пдгр","4":"ООП 1подгр (отработка)","5":null,"6":null},
//     {"day":"","date":"16.02.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"17.02.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"вторник","date":"18.02.2020","1":"ООП","11":"КГ ","2":"17вт1 бд 1пдгр","22":"КГ ","3":"17вт1 сети","4":"","5":null,"6":null},
//     {"day":"среда","date":"19.02.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"20.02.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 сети","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"21.02.2020","1":"оснорвы права","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"22.02.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети 2пдгр","4":"ООП 2 подгр (отработка)","5":null,"6":null},
//     {"day":"","date":"23.02.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"24.02.2020","1":"основы права","11":"","2":"","22":"ООП","3":"Комп графика","4":"","5":null,"6":null},
//     {"day":"вторник","date":"25.02.2020","1":"ООП","11":"17вт1 бд 2пдгр","2":"17вт1 бд","22":"","3":"17вт1 сети 2пдгр","4":"17вт1 сети 2пдгр","5":null,"6":null},
//     {"day":"среда","date":"26.02.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"27.02.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"28.02.2020","1":"физ-ра","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"29.02.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"","date":"01.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"02.03.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"","5":null,"6":null},
//     {"day":"вторник","date":"03.03.2020","1":"ООП","11":"КГ ","2":"17вт1 бд 1пдгр","22":"КГ ","3":"17вт1 сети","4":"17вт1 сети 2пдгр","5":null,"6":null},
//     {"day":"среда","date":"04.03.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"05.03.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 сети","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"06.03.2020","1":"основы права","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"07.03.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"воскресенье","date":"08.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"09.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"вторник","date":"10.03.2020","1":"ООП","11":"17вт1 бд 2пдгр","2":"17вт1 бд","22":"","3":"17вт1 сети 2пдгр","4":"17вт1 сети 2пдгр","5":null,"6":null},
//     {"day":"среда","date":"11.03.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"12.03.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"13.03.2020","1":"физ-ра","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"14.03.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"воскресенье","date":"15.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"16.03.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"","5":null,"6":null},
//     {"day":"вторник","date":"17.03.2020","1":"ООП","11":"КГ ","2":"17вт1 бд 1пдгр","22":"КГ ","3":"17вт1 сети","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"среда","date":"18.03.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"19.03.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 сети","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"20.03.2020","1":"основы права","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"ООП лекц (отработка)","5":null,"6":null},
//     {"day":"суббота","date":"21.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"воскресенье","date":"22.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"23.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"вторник","date":"24.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"среда","date":"25.03.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"26.03.2020","1":"ООП","11":"17вт1 бд 2пдгр","2":"КГ","22":"ООП","3":"17вт1 1С","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"27.03.2020","1":"физ-ра","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"28.03.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети 1пдгр","4":"","5":null,"6":null},
//     {"day":"воскресенье","date":"29.03.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null},
//     {"day":"понедельник","date":"30.03.2020","1":"основы права","11":"","2":"ООП","22":"","3":"Комп графика","4":"","5":null,"6":null},
//     {"day":"вторник","date":"31.03.2020","1":"ООП","11":"КГ ","2":"17вт1 бд 1пдгр","22":"КГ ","3":"17вт1 сети","4":"17вт1 сети 1пдгр","5":null,"6":null},
//     {"day":"среда","date":"01.04.2020","1":"ООП","11":"","2":"основы права","22":"","3":"Физ-ра","4":"Казахстанское право","5":null,"6":null},
//     {"day":"четверг","date":"02.04.2020","1":"ООП","11":"КГ ","2":"КГ","22":"ООП","3":"17вт1 сети","4":"Казахстанское право","5":null,"6":null},
//     {"day":"пятница","date":"03.04.2020","1":"основы права","11":"","2":"17вт1 1С","22":"","3":"17вт1 бд","4":"","5":null,"6":null},
//     {"day":"суббота","date":"04.04.2020","1":"КГ","11":"","2":"ООП","22":"","3":"17вт1 сети 2пдгр","4":"17вт1 сети 2пдгр","5":null,"6":null},
//     {"day":"воскресенье","date":"05.04.2020","1":"","11":"","2":"","22":"","3":"","4":"","5":null,"6":null}];
//
// let n = [];
// b.forEach((value, index) => {
//     let date = value.date,
//         day = value.day,
//         l1 = value["1"] || null,
//         l12 = value["11"] || null,
//         l2 = value["2"] || null,
//         l21 = value["21"] || null,
//         l3 = value["3"] || null,
//         l4 = value["4"] || null,
//         l5 = value["5"] || null,
//         l6 = value["6"] || null;
//
//     l12 = l12 ? " : " + l12 : '';
//     l21 = l21 ? " : " + l21 : '';
//
//     l1 = l1 ? l1 + l12 : null ;
//     l2 = l2 ? l2 + l21 : null;
//
//     n.push({
//         l1: l1,
//         l2: l2,
//         l3: l3,
//         l4: l4,
//         l5: l5,
//         l6: l6,
//         date: date
//     });
// });
// // // console.log(b);
// // console.log(n);
// db.run("DELETE FROM LESSONS");
// n.forEach((value, index) => {
//     // console.log(index);
//     let l1 = value.l1,
//         l2 = value.l2,
//         l3 = value.l3,
//         l4 = value.l4,
//         l5 = value.l5,
//         l6 = value.l6,
//         date = value.date;
//         date = date.split(".");
//         // console.log();
//     date = new Date(date[2], date[1]-1, date[0]);
//     // console.log([date,l1,l2,l3,l4,l5,l6]);
//     date.setHours(0, 0, 0, 0);
//     db.run(`INSERT INTO LESSONS(date,l1,l2,l3,l4,l5,l6)VALUES (?,?,?,?,?,?,?)` ,[date,l1,l2,l3,l4,l5,l6] ,function (err) {
//             if (err) {
//                 return console.log(err.message);
//             }
//             console.log(`A row has been inserted with rowid ${this.lastID}`);
//         });
// });


Date.prototype.getWeek = function() {
    var onejan = new Date(this.getFullYear(), 0, 1);
    return Math.ceil((((this - onejan) / 86400000) + onejan.getDay() + 1) / 7);
};
    let date = new Date();
    console.log(date);


// for (let i = 1; i <= 12; i++) {
//     for (let j = 1; j <= 31; j++) {
//         let data = new Date(2020, i - 1, j);
//         let b = a[data.getDay()][1];
//
//         db.run(`INSERT INTO LESSONS(date,l1,l2,l3,l4,l5,l6)VALUES (?,?,?,?,?,?,?)`, data, a[data.getDay()][1], a[data.getDay()][2], a[data.getDay()][3], a[data.getDay()][4], a[data.getDay()][5], a[data.getDay()][6] , function (err) {
//             if (err) {
//                 return console.log(err.message);
//             }
//             console.log(`A row has been inserted with rowid ${this.lastID}`);
//         });
//     }
//
// }


/*for (var i = 1; i <= 12; i++) {
    for (var j = 1; j <= 31; j++) {
        var data = new Date(2019, i - 1, j)
        //console.log(data.getDate())
        console.log(data.getDay())
        console.dir(data.toDateString())
        file[i][j]={}
        file[i][j] = a[data.getDay()]
        /*if (file[i][j]) {
            if (data.getWeek() % 2) {
                file[i][j].week = "Н"
            } else {
                file[i][j].week = "Ч"
            }
        }*/
/*console.dir(file[i][j])

}
}
fs.writeFileSync("schedule.json", JSON.stringify(file))
let rand = randomInteger(1,100)*/

//console.dir(file.items[rand].attachments[0].photo.sizes[file.items[rand].attachments[0].photo.sizes.length-1].url);


function inInterval(value) {
    if (value >= 1 && value <= 12) {
        return true;
    } else {
        return false;
    }
}

//console.log(inInterval('ыв'))

/*if (hour >0  &&  hour <8 ){
  console.log(file[dat.getMonth()][dat.getDate()])
}else if (hour >=8 && hour <=9){
    if (hour == 9 && min>=30){
        console.log(file[dat.getMonth()+1][dat.getDate()]["3"])
    }else{
        console.log(file[dat.getMonth()+1][dat.getDate()]["2"])
       
    }
}else if (hour>=10 && hour <=11){
    if ( (hour == 11 && min >= 10) ) {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["4"])
    } else {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["3"])

    }
} else if (hour >= 12 && hour <= 13) {
    if (hour == 13 && min >= 10) {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["5"])
    } else {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["4"])

    }
} else if (hour >= 14 && hour <= 15 ) {
    if (hour == 15 && min>=10) {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["6"])
    } else {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["5"])

    }
} else if (hour >= 18 ) {
    if (hour == 18 && min < 10) {
        console.log(file[dat.getMonth() + 1][dat.getDate()]["6"])
    } else {
        console.log("Поздно уже для пар то")

    }
}*/
function randomInteger(min, max) {
    // получить случайное число от (min-0.5) до (max+0.5)
    let rand = min - 0.5 + Math.random() * (max - min + 1);
    return Math.round(rand);
}

Date.prototype.getWeek = function () {
    var date = new Date(this.getTime());
    date.setHours(0, 0, 0, 0);
    // Thursday in current week decides the year.
    date.setDate(date.getDate() + 3 - (date.getDay() + 6) % 7);
    // January 4 is always in week 1.
    var week1 = new Date(date.getFullYear(), 0, 4);
    // Adjust to Thursday in week 1 and count number of weeks from date to week1.
    return 1 + Math.round(((date.getTime() - week1.getTime()) / 86400000 - 3 + (week1.getDay() + 6) % 7) / 7);
}